Great and I welcome you to this new step in Data Analysis using Python.

Remember now onwards we having some very important topics that are critical and important for us in analyzing the data in python. There are many modules but those we study are very worthy.

So For next few coming classes we will be focusing on these modules.

# Numpy, Pandas, Matplotlib

In [198]:
# How to import these

import numpy

import pandas

import matplotlib

# very simple
# Now How to use them
# Where I Get help to use them

# What background i should have to learn or master these
# Em, hold on hold on

# We answer these questions but be patience 

# Lets Get Overview of these three in this class

# I am sure its gonna be exciting

## Numpy

Provides
  1. An array object of arbitrary homogeneous items
  2. Fast mathematical operations over arrays
  3. Linear Algebra, Fourier Transforms, Random Number Generation


In this very useful notebook we see Converting Python array_like Objects to NumPy Arrays, Intrinsic NumPy Array Creation.


Numpy is the core library for scientific computing in Python. It provides a high-performance multidimensional array object, and tools for working with these arrays.

Numpy is most suitable for performing basic numerical computations such as mean, median, range, etc. Alongside, it also supports the creation of multi-dimensional arrays.
Numpy library can also be used to integrate C/C++ and Fortran code.

In [199]:
#load the library and check its version, just to make sure we aren't using an older version
import numpy as np
np.__version__

'1.11.3'

Hope you covered previous classes or Notebooks for python understanding if not you can also visit https://docs.python.org/3/tutorial/ 

#### Arrays
Numpy arrays are homogeneous in nature, i.e., they comprise one data type (integer, float, double, etc.) unlike lists.

NumPy’s main object is the homogeneous multidimensional array. It is a table of elements (usually numbers), all of the same type, indexed by a tuple of positive integers. In NumPy dimensions are called axes. The number of axes is rank.

#### NumPy’s array class is called ndarray. It is also known by the alias array. Note that numpy.array is not the same as the Standard Python Library class array.array, which only handles one-dimensional arrays and offers less functionality. The more important attributes of an ndarray object are:

#### ndarray.ndim
the number of axes (dimensions) of the array. In the Python world, the number of dimensions is referred to as rank.
#### ndarray.shape
the dimensions of the array. This is a tuple of integers indicating the size of the array in each dimension. For a matrix with n rows and m columns, shape will be (n,m). The length of the shape tuple is therefore the rank, or number of dimensions, ndim.
#### ndarray.size
the total number of elements of the array. This is equal to the product of the elements of shape.
#### ndarray.dtype
an object describing the type of the elements in the array. One can create or specify dtype’s using standard Python types. Additionally NumPy provides types of its own. numpy.int32, numpy.int16, and numpy.float64 are some examples.
#### ndarray.itemsize
the size in bytes of each element of the array. For example, an array of elements of type float64 has itemsize 8 (=64/8), while one of type complex32 has itemsize 4 (=32/8). It is equivalent to ndarray.dtype.itemsize.
#### ndarray.data
the buffer containing the actual elements of the array. Normally, we won’t need to use this attribute because we will access the elements in an array using indexing facilities.

We can initialize numpy arrays from nested Python lists, and access elements using square brackets:

import numpy as np

a = np.array([1, 2, 3])   # Create a rank 1 array
print(type(a))            # Prints "<class 'numpy.ndarray'>"
print(a.shape)            # Prints "(3,)"
print(a[0], a[1], a[2])   # Prints "1 2 3"
a[0] = 5                  # Change an element of the array
print(a)                  # Prints "[5, 2, 3]"

b = np.array([[1,2,3],[4,5,6]])    # Create a rank 2 array
print(b.shape)                     # Prints "(2, 3)"
print(b[0, 0], b[0, 1], b[1, 0])   # Prints "1 2 4"

np.array([[1,23,3],[4,32,2]]).shape

For example, the coordinates of a point in 3D space [1, 2, 1] is an array of rank 1, because it has one axis. That axis has a length of 3. In the example pictured below, the array has rank 2 (it is 2-dimensional). The first dimension (axis) has a length of 2, the second dimension has a length of 3.

In [200]:
d = np.array( [ [ 1., 0., 0.] ,
                [ 0.,1., 2.]]   )

print(d)
print(d.shape)

[[ 1.  0.  0.]
 [ 0.  1.  2.]]
(2, 3)

#### Numpy provides numerous important methods to create arrays

In [201]:

a = np.zeros( (2,2) )   # Create an array of all zeros
# Read about zeros funtion by just click shift + tab
print("a of zeros: \n",a)


b = np.ones( (2,2) )
print("b of ones: \n",b)


c = np.full((2,2), 9.)  # Create a constant array with each element as 9
print("c of full: \n",c)


d = np.eye(3)         # Create a 2x2 identity matrix
print("d of identity \n",d)              # Prints "[[ 1.  0.]

e = np.random.random((2,2))  # Create an array filled with random values
print("e of type: ",type(e))
print("e of random elements: \n",e)         

f = np.arange(15)
print("f dtype: ",f.dtype)
print("f: \n",f)

g = f.reshape(3,5) # Shape it in 3 rows and 5 cols: Rank 3
print("Reshaping f to g: \n",g)

a of zeros:
 [[ 0.  0.]
 [ 0.  0.]]
b of ones:
 [[ 1.  1.]
 [ 1.  1.]]
c of full:
 [[ 9.  9.]
 [ 9.  9.]]
d of identity
 [[ 1.  0.  0.]
 [ 0.  1.  0.]
 [ 0.  0.  1.]]
e of type:  <class 'numpy.ndarray'>
e of random elements:
 [[  9.46890637e-01   9.58652366e-01]
 [  4.58959806e-04   5.47184740e-01]]
f dtype:  int32
f:
 [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14]
Reshaping f to g:
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]]

In [202]:
numpy.ndarray?

In [203]:
np?

#### Array indexing

Numpy offers several ways to index into arrays.

##### Slicing: Similar to Python lists, numpy arrays can be sliced. Since arrays may be multidimensional, you must specify a slice for each dimension of the array:

In [204]:
# Full demo of it

# Case 1


import numpy as np 

# Create the following rank 2 array with shape (3, 4)
# [[ 1  2  3  4]
#  [ 5  6  7  8]
#  [ 9 10 11 12]]
a = np.array([[1,2,3,4], [5,6,7,8], [9,10,11,12]])
print("a: \n", a)

# Use slicing to pull out the subarray consisting of the first 2 rows
# and columns 1 and 2; b is the following array of shape (2, 2):
# [[2 3]
#  [6 7]]
b = a[0:2, 1:3]
print("b: \n",b )

# A slice of an array is a view into the same data, so modifying it
# will modify the original array.
print(a[0, 1])   # Prints "2"
b[0, 0] = 77     # b[0, 0] is the same piece of data as a[0, 1]
# print(a[0, 1])   # Prints "77"

a:
 [[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]
b:
 [[2 3]
 [6 7]]
2

In [205]:
# Case 2

import numpy as np

# Create the following rank 2 array with shape (3, 4)
# [[ 1  2  3  4]
#  [ 5  6  7  8]
#  [ 9 10 11 12]]
a = np.array([[1,2,3,4], [5,6,7,8], [9,10,11,12]])

# Two ways of accessing the data in the middle row of the array.
# Mixing integer indexing with slices yields an array of lower rank,
# while using only slices yields an array of the same rank as the
# original array:
row_r1 = a[1, :]    # Rank 1 view of the second row of a
row_r2 = a[1:2, :]  # Rank 2 view of the second row of a
print(row_r1, row_r1.shape)  # Prints "[5 6 7 8] (4,)"
print(row_r2, row_r2.shape)  # Prints "[[5 6 7 8]] (1, 4)"

# We can make the same distinction when accessing columns of an array:
col_r1 = a[:, 1]
col_r2 = a[:, 1:2]
print(col_r1, col_r1.shape)  # Prints "[ 2  6 10] (3,)"
print(col_r2, col_r2.shape)  # Prints "[[ 2]
                             #          [ 6]
                             #          [10]] (3, 1)"

[5 6 7 8] (4,)
[[5 6 7 8]] (1, 4)
[ 2  6 10] (3,)
[[ 2]
 [ 6]
 [10]] (3, 1)

#### Boolean array indexing:

Boolean array indexing lets you pick out arbitrary elements of an array. Frequently this type of indexing is used to select the elements of an array that satisfy some condition. Here is an example:

In [206]:

import numpy as np

a = np.array([[1,2], [3, 4], [5, 6]])

bool_idx = (a > 2)   # Find the elements of a that are bigger than 2;
                     # this returns a numpy array of Booleans of the same
                     # shape as a, where each slot of bool_idx tells
                     # whether that element of a is > 2.

print(bool_idx)      # Prints "[[False False]
                     #          [ True  True]
                     #          [ True  True]]"

# We use boolean array indexing to construct a rank 1 array
# consisting of the elements of a corresponding to the True values
# of bool_idx
print(a[bool_idx])  # Prints "[3 4 5 6]"

# We can do all of the above in a single concise statement:
print(a[a > 2])     # Prints "[3 4 5 6]"

[[False False]
 [ True  True]
 [ True  True]]
[3 4 5 6]
[3 4 5 6]

#### Array math

Basic mathematical functions operate elementwise on arrays, and are available both as operator overloads and as functions in the numpy module:

In [207]:
import numpy as np

# Please Imagine doing those operations using loops or so :D 

x = np.array([[1,2],[3,4]])
y = np.array([[5,6],[7,8]])

# Elementwise sum; both produce the array
# [[ 6.0  8.0]
#  [10.0 12.0]]
print(x + y)
print("Addition: \n", np.add(x, y))

# Elementwise difference; both produce the array
# [[-4.0 -4.0]
#  [-4.0 -4.0]]
print("Substraction: \n" ,x - y)
print(np.subtract(x, y))

# Elementwise product; both produce the array
# [[ 5.0 12.0]
#  [21.0 32.0]]
print("Multiplication: \n",x * y)
print(np.multiply(x, y))

# Elementwise division; both produce the array
# [[ 0.2         0.33333333]
#  [ 0.42857143  0.5       ]]
print("Division: \n", x / y)
print(np.divide(x, y))

# Elementwise square root; produces the array
# [[ 1.          1.41421356]
#  [ 1.73205081  2.        ]]
print("Square Root: \n",np.sqrt(x))

[[ 6  8]
 [10 12]]
Addition:
 [[ 6  8]
 [10 12]]
Substraction:
 [[-4 -4]
 [-4 -4]]
[[-4 -4]
 [-4 -4]]
Multiplication:
 [[ 5 12]
 [21 32]]
[[ 5 12]
 [21 32]]
Division:
 [[ 0.2         0.33333333]
 [ 0.42857143  0.5       ]]
[[ 0.2         0.33333333]
 [ 0.42857143  0.5       ]]
Square Root:
 [[ 1.          1.41421356]
 [ 1.73205081  2.        ]]

#### Dot products

In [208]:
a= np.array([2,2])  
b= np.array([3,5])
print("Elementwise: \n", a*b )

print("Dot product: ", np.dot(a,b))
print('___________________________')

# Case 3:


import numpy as np

x = np.array([[1,2],[3,4]])
y = np.array([[5,6],[7,8]])
print("x shape: ", x.shape)

v = np.array([9,10])
w = np.array([11, 12])

# Inner product of vectors; both produce 219
print(v.dot(w))
print(np.dot(v, w))

# Matrix / vector product; both produce the rank 1 array [29 67]
print(x.dot(v))
print(np.dot(x, v))

# Matrix / matrix product; both produce the rank 2 array
# [[19 22]
#  [43 50]]
print(x.dot(y))
print(np.dot(x, y))

Elementwise:
 [ 6 10]
Dot product:  16
___________________________
x shape:  (2, 2)
219
219
[29 67]
[29 67]
[[19 22]
 [43 50]]
[[19 22]
 [43 50]]

In [209]:
# lets summarize
# other methods
import numpy as np

x = np.array([[1,2],[3,4]])

print(np.sum(x))  # Compute sum of all elements; prints "10"
print(np.sum(x, axis=0))  # Compute sum of each column; prints "[4 6]"
print(np.sum(x, axis=1))  # Compute sum of each row; prints "[3 7]"

10
[4 6]
[3 7]

##### For more see the docs: https://docs.scipy.org/doc/numpy/reference/routines.math.html

In [210]:
# Lets play more on numpy
# Transpose

x = np.array([[1,23,3],[3,4,5]])

print(x)
print ( x.shape ) 
print ( x.T ) # Transpose
print ( x.T.shape )

[[ 1 23  3]
 [ 3  4  5]]
(2, 3)
[[ 1  3]
 [23  4]
 [ 3  5]]
(3, 2)

##### Broadcasting

Broadcasting is a powerful mechanism that allows numpy to work with arrays of different shapes when performing arithmetic operations. Frequently we have a smaller array and a larger array, and we want to use the smaller array multiple times to perform some operation on the larger array.

For example, suppose that we want to add a constant vector to each row of a matrix. We could do it like this:

In [211]:
# Not a better way of doing it

import numpy as np

# We will add the vector v to each row of the matrix x,
# storing the result in the matrix y
x = np.array([[1,2,3], [4,5,6], [7,8,9], [10, 11, 12]])
v = np.array([1, 0, 1])
y = np.empty_like(x)   # Create an empty matrix with the same shape as x

# Add the vector v to each row of the matrix x with an explicit loop
for i in range(4):
    y[i, :] = x[i, :] + v

# Now y is the following
# [[ 2  2  4]
#  [ 5  5  7]
#  [ 8  8 10]
#  [11 11 13]]
print(y)

[[ 2  2  4]
 [ 5  5  7]
 [ 8  8 10]
 [11 11 13]]

In [212]:
# What is better way of doing it
# Numpy broadcasting allows us to perform this computation without actually creating multiple copies of v. Consider this version, using broadcasting:

import numpy as np

# We will add the vector v to each row of the matrix x,
# storing the result in the matrix y
x = np.array([[1,2,3], [4,5,6], [7,8,9], [10, 11, 12]])
v = np.array([1, 0, 1])
y = x + v  # Add v to each row of x using broadcasting
print(y)  # Prints "[[ 2  2  4]
          #          [ 5  5  7]
          #          [ 8  8 10]
          #          [11 11 13]]"

[[ 2  2  4]
 [ 5  5  7]
 [ 8  8 10]
 [11 11 13]]

#### broadcasting can be diffiult to understand but if is better to see the situation. See docs if you want more:) 
One very useful link to it http://scipy.github.io/old-wiki/pages/EricsBroadcastingDoc


In addition to the functions we learned above, there are several other mathematical functions available in the numpy library such as sum, divide, multiple, abs, power, mod, sin, cos, tan, log, var, min, mean, max, etc. which you can be used to perform basic arithmetic calculations. Feel free to refer to numpy documentation for more information on such functions.



For time being it is good for us to move on Pandas.


# Pandas in Python
pandas is an open source, BSD-licensed library providing <b>high-performance, easy-to-use data structures and data analysis</b> tools for the Python programming language.

Best to explore in details: https://pandas.pydata.org/pandas-docs/stable/tutorials.html
But we will focus on we need for now.


Lets start and import it

In [213]:
#load library - pd is just an alias. I used pd because it's short and literally abbreviates pandas.
#You can use any name as an alias. 
import pandas as pd

# lets learn from quick docs
pandas?

In [214]:
# First clear the idea as we are dealing with tabular form many times so

#create a data frame 
# We already know dictionaries yup so
# dictionary is used here where keys get converted to column names and values to row values.


# pd.DataFrame?

# 1
data = pd.DataFrame( 
                    {
                    'Country': ['Pakistan','India','Australia','South Africa'],
                    'Rank':[1,2,3,4]
                    }
                )


data


# 2
# temp = pd.DataFrame(np.array([1,2]), columns=['ABC'])
# print(temp)

        Country  Rank
0      Pakistan     1
1         India     2
2     Australia     3
3  South Africa     4

##### Lets move to some basic analysis

In [215]:


# We can do a quick analysis of any data set using:
data.describe()

# enter shift+tab on describe to get quick overview
# Generate various summary statistics, excluding NaN values.

           Rank
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [216]:
# Concise summary of a DataFrame.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
Country    4 non-null object
Rank       4 non-null int64
dtypes: int64(1), object(1)
memory usage: 144.0+ bytes

In [217]:
# Now lets create a dataframe

#Let's create another data frame about some heights and weights.
data = pd.DataFrame(
                        {
                        'names':['Adam', 'Kabir', 'James', 'Hammad','uttoman', 'Saleem', 'Durga'],
                         'heights':[5  , 6      ,  7     ,  6      , 8       ,  5      ,  4],
                         'weights':[55 , 60     ,  78    ,  69     , 88      ,  89     ,  38],
                        }
                    )
data

   heights    names  weights
0        5     Adam       55
1        6    Kabir       60
2        7    James       78
3        6   Hammad       69
4        8  uttoman       88
5        5   Saleem       89
6        4    Durga       38

We can sort the data by not just one column but multiple columns as well.

In [218]:
# 1 
# Let's sort the data frame by ounces - inplace = True will make changes to the data
data.sort_values(by=['heights'],ascending=True)

   heights    names  weights
6        4    Durga       38
0        5     Adam       55
5        5   Saleem       89
1        6    Kabir       60
3        6   Hammad       69
2        7    James       78
4        8  uttoman       88

In [219]:
# 2

data.sort_values(by=['heights','weights'],ascending=[True,True])

   heights    names  weights
6        4    Durga       38
0        5     Adam       55
5        5   Saleem       89
1        6    Kabir       60
3        6   Hammad       69
2        7    James       78
4        8  uttoman       88

Often, we get data sets with duplicate rows, which is nothing but noise. Therefore, before training the model (<b>not to worry it is machine learning module we will cover later</b>), we need to make sure we get rid of such inconsistencies in the data set. Let's see how we can remove duplicate rows.

In [220]:
#create another data with duplicated rows

data = pd.DataFrame(
                        {
                            'name': ['Adam']*3 + ['James']*4 ,
                            'rollno'   : [3,2,1,3,3,4,4]
                        }
                    )

data

    name  rollno
0   Adam       3
1   Adam       2
2   Adam       1
3  James       3
4  James       3
5  James       4
6  James       4

In [221]:
#sort values 
data.sort_values(by='rollno')

    name  rollno
2   Adam       1
1   Adam       2
0   Adam       3
3  James       3
4  James       3
5  James       4
6  James       4

In [222]:
# See above whoo
# functions as duplicate rows removed

data.drop_duplicates()

# Done haha
# See docs as mentioned and tell how to remove based on particular column

    name  rollno
0   Adam       3
1   Adam       2
2   Adam       1
3  James       3
5  James       4

In [223]:
# Here it is
data.drop_duplicates(subset='rollno')

# voila ! 
# isn't :D

    name  rollno
0   Adam       3
1   Adam       2
2   Adam       1
5  James       4

##### Now lets discuss a really helpful case to grip things i read a very useful example from a site really nice they did that it is 

say we have got a column with country names and we want to create a new variable 'continent' based on these country names. In such situations, we will require the steps below:

In [224]:
data = pd.DataFrame(
                    {
                        'food':   ['beef','camel','chicken', 'Bridie' ],
                        'ounces': [ 4    , 3     , 12    , 6          ]
                    }
                )


data

# Now, we want to create a new variable which indicates the type of animal which acts as the source of the food. 
# To do that, first we'll create a dictionary to map the food to the animals. Then, we'll use map function to map the dictionary's values to the keys. Let's see how is it done.

      food  ounces
0     beef       4
1    camel       3
2  chicken      12
3   Bridie       6

In [234]:
# Let create a dic
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon',
'camel':'camel',
'chicken':'chicken',
'Bridie': 'goat'
}




#create a new variable
data['animal'] = data['food'].map(meat_to_animal)
data

      food  ounces   animal animal_test
0     beef       4      cow         cow
1    camel       3    camel       camel
2  chicken      12  chicken     chicken
3   Bridie       6     goat        goat

In [235]:
data['animal_test'] = data['food'].map(meat_to_animal)
data

      food  ounces   animal animal_test
0     beef       4      cow         cow
1    camel       3    camel       camel
2  chicken      12  chicken     chicken
3   Bridie       6     goat        goat

In [237]:
#### How to remove a column from dataframe
data.drop('animal_test',axis='columns')
data

      food  ounces   animal animal_test
0     beef       4      cow         cow
1    camel       3    camel       camel
2  chicken      12  chicken     chicken
3   Bridie       6     goat        goat

##### We frequently find missing values in our data set. A quick method for imputing missing values is by filling the missing value with any random number. Not just missing values, you may find lots of outliers in your data set, which might require replacing. Let's see how can we replace values.

In [238]:
#Series function from pandas are used to create arrays
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [240]:
# Replace values given in 'to_replace' with 'value'
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [242]:
#We can also replace multiple values at once.
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data.replace([-999,-1000],np.nan)
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

#### How to give column names
Now, let's learn how to rename column names and axis (row names).

In [244]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

# Got it?
# you should it is pretty simple

# But this when we created own values
# what about already created variable

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [246]:
#Using rename function
data.rename(index = {'Ohio':'SanF'}, columns={'one':'one_p','two':'two_p'})
data

          one_p  two_p  three  four
SanF          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

#### Hope you got the importance of Dictionaries so far in our journey

Are you? Rock On


I am sure these things will be handy for you in near future. Let do Guys. :D


#### Next, we'll learn to categorize (bin) continuous variables.

In [252]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# We'll divide the ages into bins such as 18-25, 26-35,36-60 and 60 and above.

bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

# Understand the output - '(' means the value is included in the bin, '[' means the value is excluded

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [257]:
#pandas library intrinsically assigns an encoding to categorical variables.
print(type(cats))
print(cats.codes) # We already seen a feature before recall it

#Let's check how many observations fall under each bin
pd.value_counts(cats)

<class 'pandas.core.categorical.Categorical'>
[0 0 0 1 0 0 2 1 3 2 2 1]

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [258]:
# Not only this 
# we can pass a unique name to each label.

bin_names = ['Youth', 'YoungAdult', 'MiddleAge', 'Senior']
new_cats = pd.cut(ages, bins,labels=bin_names)

pd.value_counts(new_cats)

Youth         5
MiddleAge     3
YoungAdult    3
Senior        1
dtype: int64

In [259]:
#we can also calculate their cumulative sum
pd.value_counts(new_cats).cumsum()

Youth          5
MiddleAge      8
YoungAdult    11
Senior        12
dtype: int64

### Grouping data and Creating pivots in pandas
Let's proceed and learn about grouping data and creating pivots in pandas. 
It's an immensely important data analysis method which you'd probably have to use on every data set you work with.

In [306]:
# Now can you create a simple dataframe

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : [2,2,2,1,1],
                   'data2' : [2,1,1,1,1]})
df

   data1  data2 key1 key2
0      2      2    a  one
1      2      1    a  two
2      2      1    b  one
3      1      1    b  two
4      1      1    a  one

In [307]:
#calculate the mean of data1 column by key1
grouped = df['data1'].groupby(df['key1'])
print( grouped.mean() )

print(grouped)

key1
a    1.666667
b    1.500000
Name: data1, dtype: float64
<pandas.core.groupby.SeriesGroupBy object at 0x000002391068CBE0>

#### Slicing Dataframes
Now, let's see how to slice the data frame.

In [308]:
dates = pd.date_range('20130101',periods=6)

# np.random.randn(6,4) Hope you know what it is going to do
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'] )
df

                   A         B         C         D
2013-01-01  1.289956 -0.156534 -0.761290  0.475382
2013-01-02 -1.361713 -0.349665  1.012092 -0.791710
2013-01-03 -0.044096 -0.981607  0.300552  1.944070
2013-01-04 -0.162617  0.185896 -0.041126 -0.995812
2013-01-05  2.366392  1.178779  0.472581 -0.720754
2013-01-06 -0.715856 -0.083995  0.383233 -0.397080

In [309]:
# 1 get first n rows from the data frame
df[:3]

                   A         B         C         D
2013-01-01  1.289956 -0.156534 -0.761290  0.475382
2013-01-02 -1.361713 -0.349665  1.012092 -0.791710
2013-01-03 -0.044096 -0.981607  0.300552  1.944070

In [310]:
#slice based on date range
df['20130101':'20130104']

                   A         B         C         D
2013-01-01  1.289956 -0.156534 -0.761290  0.475382
2013-01-02 -1.361713 -0.349665  1.012092 -0.791710
2013-01-03 -0.044096 -0.981607  0.300552  1.944070
2013-01-04 -0.162617  0.185896 -0.041126 -0.995812

In [311]:
#slicing based on column names
df.loc[:,['A','B']]      # All rows and  'A' and 'B' cols

                   A         B
2013-01-01  1.289956 -0.156534
2013-01-02 -1.361713 -0.349665
2013-01-03 -0.044096 -0.981607
2013-01-04 -0.162617  0.185896
2013-01-05  2.366392  1.178779
2013-01-06 -0.715856 -0.083995

In [312]:
#slicing based on both row index labels and column names
df.loc['20130102':'20130103',['A','B']]

                   A         B
2013-01-02 -1.361713 -0.349665
2013-01-03 -0.044096 -0.981607

In [313]:
print(df)

#slicing based on index of columns
df.iloc[:3,2:] #returns 4th row (index is 3rd)

                   A         B         C         D
2013-01-01  1.289956 -0.156534 -0.761290  0.475382
2013-01-02 -1.361713 -0.349665  1.012092 -0.791710
2013-01-03 -0.044096 -0.981607  0.300552  1.944070
2013-01-04 -0.162617  0.185896 -0.041126 -0.995812
2013-01-05  2.366392  1.178779  0.472581 -0.720754
2013-01-06 -0.715856 -0.083995  0.383233 -0.397080

                   C         D
2013-01-01 -0.761290  0.475382
2013-01-02  1.012092 -0.791710
2013-01-03  0.300552  1.944070

In [314]:
#Similarly, we can do Boolean indexing based on column values as well. This helps in filtering a data set based on a pre-defined condition.

df[df.A > 1]

                   A         B         C         D
2013-01-01  1.289956 -0.156534 -0.761290  0.475382
2013-01-05  2.366392  1.178779  0.472581 -0.720754

In [315]:
#we can copy the data set
df2 = df.copy()
df2['E']=['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.289956 -0.156534 -0.761290  0.475382    one
2013-01-02 -1.361713 -0.349665  1.012092 -0.791710    one
2013-01-03 -0.044096 -0.981607  0.300552  1.944070    two
2013-01-04 -0.162617  0.185896 -0.041126 -0.995812  three
2013-01-05  2.366392  1.178779  0.472581 -0.720754   four
2013-01-06 -0.715856 -0.083995  0.383233 -0.397080  three

# Hey All is going just fantastic

We are going quite well. I made it for you do not let me go. 


Now the last but important part. 
Great! ;)

In [316]:
#select rows based on column values
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.044096 -0.981607  0.300552  1.944070   two
2013-01-05  2.366392  1.178779  0.472581 -0.720754  four

In [319]:
#list all columns where A is greater than C
df.loc[df['A'] > df['C']]

                   A         B         C         D
2013-01-01  1.289956 -0.156534 -0.761290  0.475382
2013-01-05  2.366392  1.178779  0.472581 -0.720754

# See Docs further https://pandas.pydata.org/pandas-docs/stable/basics.html

In [320]:
df.query('A < B | C > A')

                   A         B         C         D
2013-01-02 -1.361713 -0.349665  1.012092 -0.791710
2013-01-03 -0.044096 -0.981607  0.300552  1.944070
2013-01-04 -0.162617  0.185896 -0.041126 -0.995812
2013-01-06 -0.715856 -0.083995  0.383233 -0.397080

### Pivot Tables:
Pivot tables are extremely useful in analyzing data using a customized tabular format. I think, among other things, Excel is popular because of the pivot table option. 
It offers a super-quick way to analyze data.

A pivot table allows you to extract the significance from a large, detailed data set.

In [324]:
#create a data frame
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [330]:
# See how simple it is 
# data.pivot_table?

#calculate means of each group
data.pivot_table(values='ounces',index='group',aggfunc=np.mean)

# look above the frame

group
a    6.333333
b    7.166667
c    4.666667
Name: ounces, dtype: float64

In [331]:
data.pivot_table(values='ounces',index='group',aggfunc='count')

group
a    3
b    3
c    3
Name: ounces, dtype: int64

## Thats it for. I know you have other stuffs to make but it is true that we together did an excellent job. Come On Data Savvies. 

See you the last but not least the Matplotlib Section 
and Some Demo Example from some real dataset in Next part 2. 


Well all that above you done is good but if you want more first consult with docs.
Resources: That can help you
# https://pandas.pydata.org/pandas-docs/stable/basics.html
# http://cs231n.github.io/python-numpy-tutorial/#numpy